{"query": "1 Chronicles 16", "canonical": "1 Chronicles 16", "parsed": [[13016001, 13016043]], "passage_meta": [{"canonical": "1 Chronicles 16", "chapter_start": [13016001, 13016043], "chapter_end": [13016001, 13016043], "prev_verse": 13015029, "next_verse": 13017001, "prev_chapter": [13015001, 13015029], "next_chapter": [13017001, 13017027]}], "passages": ["1 Chronicles 16\n\nThe Ark Placed in a Tent\n\n  [1] And they brought in the ark of God and set it inside the tent that David had pitched for it, and they offered burnt offerings and peace offerings before God. [2] And when David had finished offering the burnt offerings and the peace offerings, he blessed the people in the name of the LORD [3] and distributed to all Israel, both men and women, to each a loaf of bread, a portion of meat,(1) and a cake of raisins.\n\n  [4] Then he appointed some of the Levites as ministers before the ark of the LORD, to invoke, to thank, and to praise the LORD, the God of Israel. [5] Asaph was the chief, and second to him were Zechariah, Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed-edom, and Jeiel, who were to play harps and lyres; Asaph was to sound the cymbals, [6] and Benaiah and Jahaziel the priests were to blow trumpets regularly before the ark of the covenant of God. [7] Then on that day David first appointed that thanksgiving be sung to the LORD by Asaph and his brothers.\n\nDavid’s Song of Thanks\n\n    [8] Oh give thanks to the LORD; call upon his name;\n        make known his deeds among the peoples!\n    [9] Sing to him, sing praises to him;\n        tell of all his wondrous works!\n    [10] Glory in his holy name;\n        let the hearts of those who seek the LORD rejoice!\n    [11] Seek the LORD and his strength;\n        seek his presence continually!\n    [12] Remember the wondrous works that he has done,\n        his miracles and the judgments he uttered,\n    [13] O offspring of Israel his servant,\n        children of Jacob, his chosen ones!\n    \n    \n    [14] He is the LORD our God;\n        his judgments are in all the earth.\n    [15] Remember his covenant forever,\n        the word that he commanded, for a thousand generations,\n    [16] the covenant that he made with Abraham,\n        his sworn promise to Isaac,\n    [17] which he confirmed to Jacob as a statute,\n        to Israel as an everlasting covenant,\n    [18] saying, “To you I will give the land of Canaan,\n        as your portion for an inheritance.”\n    \n    \n    [19] When you were few in number,\n        of little account, and sojourners in it,\n    [20] wandering from nation to nation,\n        from one kingdom to another people,\n    [21] he allowed no one to oppress them;\n        he rebuked kings on their account,\n    [22] saying, “Touch not my anointed ones,\n        do my prophets no harm!”\n    \n    \n    [23] Sing to the LORD, all the earth!\n        Tell of his salvation from day to day.\n    [24] Declare his glory among the nations,\n        his marvelous works among all the peoples!\n    [25] For great is the LORD, and greatly to be praised,\n        and he is to be feared above all gods.\n    [26] For all the gods of the peoples are worthless idols,\n        but the LORD made the heavens.\n    [27] Splendor and majesty are before him;\n        strength and joy are in his place.\n    \n    \n    [28] Ascribe to the LORD, O families of the peoples,\n        ascribe to the LORD glory and strength!\n    [29] Ascribe to the LORD the glory due his name;\n        bring an offering and come before him!\n    Worship the LORD in the splendor of holiness;(2)\n    [30]     tremble before him, all the earth;\n        yes, the world is established; it shall never be moved.\n    [31] Let the heavens be glad, and let the earth rejoice,\n        and let them say among the nations, “The LORD reigns!”\n    [32] Let the sea roar, and all that fills it;\n        let the field exult, and everything in it!\n    [33] Then shall the trees of the forest sing for joy\n        before the LORD, for he comes to judge the earth.\n    [34] Oh give thanks to the LORD, for he is good;\n        for his steadfast love endures forever!\n    \n    \n      [35] Say also:\n\n    “Save us, O God of our salvation,\n        and gather and deliver us from among the nations,\n    that we may give thanks to your holy name\n        and glory in your praise.\n    [36] Blessed be the LORD, the God of Israel,\n        from everlasting to everlasting!”\n    \n    \n      Then all the people said, “Amen!” and praised the LORD.\n\nWorship Before the Ark\n\n  [37] So David left Asaph and his brothers there before the ark of the covenant of the LORD to minister regularly before the ark as each day required, [38] and also Obed-edom and his(3) sixty-eight brothers, while Obed-edom, the son of Jeduthun, and Hosah were to be gatekeepers. [39] And he left Zadok the priest and his brothers the priests before the tabernacle of the LORD in the high place that was at Gibeon [40] to offer burnt offerings to the LORD on the altar of burnt offering regularly morning and evening, to do all that is written in the Law of the LORD that he commanded Israel. [41] With them were Heman and Jeduthun and the rest of those chosen and expressly named to give thanks to the LORD, for his steadfast love endures forever. [42] Heman and Jeduthun had trumpets and cymbals for the music and instruments for sacred song. The sons of Jeduthun were appointed to the gate.\n\n  [43] Then all the people departed each to his house, and David went home to bless his household.\n\nFootnotes\n\n(1) 16:3 Compare Septuagint, Syriac, Vulgate; the meaning of the Hebrew is uncertain\n\n(2) 16:29 Or *in holy attire*\n\n(3) 16:38 Hebrew *their*\n (ESV)"]}