{"query": "Hebrews 8", "canonical": "Hebrews 8", "parsed": [[58008001, 58008013]], "passage_meta": [{"canonical": "Hebrews 8", "chapter_start": [58008001, 58008013], "chapter_end": [58008001, 58008013], "prev_verse": 58007028, "next_verse": 58009001, "prev_chapter": [58007001, 58007028], "next_chapter": [58009001, 58009028]}], "passages": ["Hebrews 8\n\nJesus, High Priest of a Better Covenant\n\n  [1] Now the point in what we are saying is this: we have such a high priest, one who is seated at the right hand of the throne of the Majesty in heaven, [2] a minister in the holy places, in the true tent(1) that the Lord set up, not man. [3] For every high priest is appointed to offer gifts and sacrifices; thus it is necessary for this priest also to have something to offer. [4] Now if he were on earth, he would not be a priest at all, since there are priests who offer gifts according to the law. [5] They serve a copy and shadow of the heavenly things. For when Moses was about to erect the tent, he was instructed by God, saying, “See that you make everything according to the pattern that was shown you on the mountain.” [6] But as it is, Christ(2) has obtained a ministry that is as much more excellent than the old as the covenant he mediates is better, since it is enacted on better promises. [7] For if that first covenant had been faultless, there would have been no occasion to look for a second.\n\n  [8] For he finds fault with them when he says:(3)\n\n    “Behold, the days are coming, declares the Lord,\n        when I will establish a new covenant with the house of Israel\n        and with the house of Judah,\n    [9] not like the covenant that I made with their fathers\n        on the day when I took them by the hand to bring them out of the land of Egypt.\n    For they did not continue in my covenant,\n        and so I showed no concern for them, declares the Lord.\n    [10] For this is the covenant that I will make with the house of Israel\n        after those days, declares the Lord:\n    I will put my laws into their minds,\n        and write them on their hearts,\n    and I will be their God,\n        and they shall be my people.\n    [11] And they shall not teach, each one his neighbor\n        and each one his brother, saying, ‘Know the Lord,’\n    for they shall all know me,\n        from the least of them to the greatest.\n    [12] For I will be merciful toward their iniquities,\n        and I will remember their sins no more.”\n    \n    \n      [13] In speaking of a new covenant, he makes the first one obsolete. And what is becoming obsolete and growing old is ready to vanish away.\n\nFootnotes\n\n(1) 8:2 Or *tabernacle*; also verse 5\n\n(2) 8:6 Greek *he*\n\n(3) 8:8 Some manuscripts *For finding fault with it he says to them*\n (ESV)"]}